---
kind: method
id: M:Autodesk.Revit.DB.ExportPDFSettings.SetOptions(Autodesk.Revit.DB.PDFExportOptions)
source: html/146cd6a1-7f80-a2dc-b1f3-525900536b9f.htm
---
# Autodesk.Revit.DB.ExportPDFSettings.SetOptions Method

Sets options for exporting.

## Syntax (C#)
```csharp
public void SetOptions(
	PDFExportOptions options
)
```

## Parameters
- **options** (`Autodesk.Revit.DB.PDFExportOptions`) - Other options.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null